// pages/disclaimer/disclaimer.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    statementList:["1.一切移动客户端用户在下载并浏览鲸遇小程序软件时均被视为已经仔细阅读本条款并完全同意。凡以任何方式登陆本小程序,或直接、间接使用本小程序资料者,均被视为自愿接受本网站相关声明和用户服务协议的约束。","2.鲸遇小程序转载的内容并不代表鲸遇小程序之意见及观点,也不意味着本网赞同其观点或证实其内容的真实性。"],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})